Repository: giellalt/corpus-sme
Catalog: tmx/eng/ficti/lyrics/karasjok_kulturskole_go_nasttit_ganjaldit.doc.tmx
Source language: sme
Languages: eng

source: Go násttit ganjaldit
eng: “ When The Stars Go Blue:

source: Headjabiktasiin
eng: (feat.

source: Leatgo lihkolaš ?
eng: Where do you go when the stars go blue ?

source: In guođe du juos leš váivi
eng: (Merci à freezy pour cettes paroles)

source: Mun jeđđen juos
eng: (feat.

source: násttit ganjaldit
eng: Where do you go when you ' re lonely Where do you go when you ' re blue Where do you go when you ' re lonely I ' ll follow you When the stars go blue When the stars go blue

source: In guođe du moraštit
eng: [x2] Where do you go when you ' re lonely

source: Mun jeđđen juos, yeah, yeah
eng: Where do you go when you ' re blue Where do you go when you ' re lonely I ' ll follow you When the stars go blue The stars go blue, stars go blue
